# Напишіть програму, що буде реалізовувати простий телефонний довідник.
# При запуску програми довідник порожній.
# Далі у користувача повинна бути можливість інтерактивно виконувати наступні операції, вводячи їх з клавіатури:
#
# - insert <Name> <Number> - додати в телефонний довідник новий запис про користувача і його номер телефону.
#
# - delete <Name> - видалити з телефонного довідника користувача і його номер телефону.
#
# - get <Name> - дізнатися номер телефону по імені користувача.
#
# <Name> - рядок із символів англійського алфавіту в верхньому або нижньому регістрі без роздільників.
# <Number> - рядок з цифр.
# Імена не повторюються.
# Кожному імені може відповідати рівно один номер телефону.
# Зберігати дані між запусками програми не потрібно.

s = ""
dictionary = {}
while s != "stop":
    s = str(input("Write the command: ")).split()
    if s[0] == "insert":
        dictionary[s[1]] = s[2]
    elif s[0] == "get":
        if s[1] in dictionary:
            print(dictionary[s[1]])
        else:
            print(s[1] + " is not found")
    elif s[0] == "delete":
        del dictionary[s[1]]
